# ERD Diagram

![png](Pictures/flat.png)

## import sql-alchemy and create engine

In [3]:
import pandas as pd
import numpy as np

import pymysql
pymysql.install_as_MySQLdb()

from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection_str = "mysql+pymysql://root:Neiu1234@localhost/books"

#create engine
engine = create_engine(connection_str)

## Create a New Database

In [4]:
# Check if the database exists. If not, create it.
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

# Lets verify that the database was created:
database_exists(connection_str)

True

## Lets add a pandas dataframe as a table to our test_db.
## Read in data

In [6]:
users_df = pd.read_csv('Data/users.csv')
users_df.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [7]:
books_df = pd.read_csv('Data/books.csv')
books_df.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [8]:
authors_df = pd.read_csv('Data/authors.csv')
authors_df.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [9]:
favs_df = pd.read_csv('Data/fav_books.csv')
favs_df.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [10]:
# Add dataframe to MySQL.
users_df.to_sql('users', engine, if_exists = 'replace')
books_df.to_sql('books', engine, if_exists = 'replace')
authors_df.to_sql('authors', engine, if_exists = 'replace')
favs_df.to_sql('fav_books', engine, if_exists = 'replace')

7

## Verify all tables have been created

In [11]:
# Show the different tables in our database
q = """
SHOW TABLES
"""
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       fav_books
3           users

## Testing the Database

In [16]:
# Test a query to make sure things are working.
# Test query : List the titles of all of John Doe's favorite books
q = """
SELECT b.title, u.id as 'user id'
FROM users as u JOIN fav_books as fb ON u.id = fb.user_id JOIN books as b ON fb.book_id = b.id
WHERE u.first_name = 'John' AND u.last_name = 'Doe'
"""
pd.read_sql(q, engine)

              title  user id
0       The Shining        1
1                It        1
2  The Great Gatsby        1